#pragma once

#include <cstdint>
#include <unistd.h>
#include <mutex>
#include "AXIQuadSPI.hpp"
#include "AXIGPIO.hpp"
#include "Utils.hpp"

#define REG_SPI_CONF                               0x000 /* SPI Configuration */
#define REG_MULTICHIP_SYNC_AND_TX_MON_CTRL         0x001 /* Multi-Chip Sync and TX Mon Control */
#define REG_TX_ENABLE_FILTER_CTRL                  0x002 /* TX Enable & Filter Control */
#define REG_RX_ENABLE_FILTER_CTRL                  0x003 /* RX Enable & Filter  Control */
#define REG_INPUT_SELECT                           0x004 /* Input Select */
#define REG_RFPLL_DIVIDERS                         0x005 /* RFPLL Dividers */
#define REG_RX_CLOCK_DATA_DELAY                    0x006 /* RX Clock & Data  Delay */
#define REG_TX_CLOCK_DATA_DELAY                    0x007 /* TX Clock & Data Delay */
#define REG_CLOCK_ENABLE                           0x009 /* Clock Enable */
#define REG_BBPLL                                  0x00A /* BBPLL */
#define REG_TEMP_OFFSET                            0x00B /* Offset */
#define REG_START_TEMP_READING                     0x00C /* Start Temp Reading */
#define REG_TEMP_SENSE2                            0x00D /* Temp Sense2 */
#define REG_TEMPERATURE                            0x00E /* Temperature */
#define REG_TEMP_SENSOR_CONFIG                     0x00F /* Temp Sensor Config */
#define REG_PARALLEL_PORT_CONF_1                   0x010 /* Parallel Port Configuration 1 */

#define DATA_PORT_LOOP_TEST_ENABLE     BIT(0) /* Data Port Loop Test Enable */
#define OBSERVATION_POINT(x)           (((x) & 0xF) << 1) /* Observation Point<2:0> */

// REG_BIST_AND_DATA_PORT_TEST_CONFIG
#define BIST_MASK_CHANNEL_2_Q_DATA     BIT(5) /* BIST Mask Channel 2 Q data */
#define BIST_MASK_CHANNEL_2_I_DATA     BIT(4) /* BIST Mask Channel 2 I data */
#define BIST_MASK_CHANNEL_1_Q_DATA     BIT(3) /* BIST Mask Channel 1 Q data */
#define BIST_MASK_CHANNEL_1_I_DATA     BIT(2) /* BIST Mask Channel 1 I data */
#define DATA_PORT_HILOW                BIT(1) /* Data Port Hi/Low */
#define USE_DATA_PORT                  BIT(0) /* Use Data Port */
#define TEMP_SENSE_VBE_TEST(x)         (((x) & 0x3) << 6) /* Temp Sense Vbe Test<1:0> */

// REG_DAC_TEST_2
#define DAC_TEST_ENABLE                BIT(7) /* DAC Test Enable */
#define DAC_TEST_WORD(x)               (((x) & 0x7F) << 0) /* DAC test Word <22:16> */


// SPI Comm Helpers
#define AD_READ       (0 << 15)
#define AD_WRITE      BIT(15)
#define AD_CNT(x)     ((((x) - 1) & 0x7) << 12)
#define AD_ADDR(x)    ((x) & 0x3FF)


// AD9361 Limits
#define RSSI_MULTIPLIER         100
#define RSSI_RESOLUTION         ((int) (0.25 * RSSI_MULTIPLIER))
#define RSSI_MAX_WEIGHT         255

#define MAX_LMT_INDEX           40
#define MAX_LPF_GAIN            24
#define MAX_DIG_GAIN            31

#define MAX_BBPLL_FREF          70007000UL /* 70 MHz + 100ppm */
#define MIN_BBPLL_FREQ          714928500UL /* 715 MHz - 100ppm */
#define MAX_BBPLL_FREQ          1430143000UL /* 1430 MHz + 100ppm */
#define MAX_BBPLL_DIV           64
#define MIN_BBPLL_DIV           2

/*
 * The ADC minimum and maximum operating output data rates
 * are 25MHz and 640MHz respectively.
 * For more information see here: https://ez.analog.com/docs/DOC-12763
 */
#define MIN_ADC_CLK             25000000U /* 25 MHz */
//#define MIN_ADC_CLK           (MIN_BBPLL_FREQ / MAX_BBPLL_DIV) /* 11.17MHz */
#define MAX_ADC_CLK             640000000U /* 640 MHz */
#define MAX_DAC_CLK             (MAX_ADC_CLK / 2)

/* Associated with outputs of stage */
#define MAX_RX_HB1              245760000UL
#define MAX_RX_HB2              320000000UL
#define MAX_RX_HB3              640000000UL
/* Associated with inputs of stage */
#define MAX_TX_HB1              160000000UL
#define MAX_TX_HB2              320000000UL
#define MAX_TX_HB3              320000000UL

#define MAX_BASEBAND_RATE       61440000UL

#define MAX_MBYTE_SPI           8

#define RFPLL_MODULUS           8388593UL
#define BBPLL_MODULUS           2088960UL

#define MAX_SYNTH_FREF          80008000UL /* 80 MHz + 100ppm */
#define MIN_SYNTH_FREF          9999000UL /* 10 MHz - 100ppm */
#define MIN_VCO_FREQ_HZ         6000000000ULL
#define MAX_CARRIER_FREQ_HZ     6000000000ULL
#define MIN_RX_CARRIER_FREQ_HZ  70000000ULL
#define MIN_TX_CARRIER_FREQ_HZ  46875001ULL

#define AD9363A_MAX_CARRIER_FREQ_HZ    3800000000ULL
#define AD9363A_MIN_CARRIER_FREQ_HZ    325000000ULL

#define MAX_TX_ATTENUATION_DB   89750

class AD9361
{
public:
    enum RXGainTableType
    {
        FULL,
        SPLIT,
    };
    enum RXGainTableName
    {
        TBL_200_1300_MHZ,
        TBL_1300_4000_MHZ,
        TBL_4000_6000_MHZ,
        MAX,
    };
    struct RXGainTableInfo
    {
        uint64_t start;
        uint64_t end;
        uint8_t max_index;
        bool split_table;
        int8_t* abs_gain_tbl;
        uint8_t(* tab)[3];
    };
    enum FIRDest
    {
        FIR_TX1 = 0x01,
        FIR_TX2 = 0x02,
        FIR_TX1_TX2 = 0x03,
        FIR_RX1 = 0x81,
        FIR_RX2 = 0x82,
        FIR_RX1_RX2 = 0x83,
        FIR_IS_RX = 0x80,
    };
    struct RFGainCtrl
    {
        uint32_t ant;
        uint8_t mode;
    };
    enum RFGainCtrlMode
    {
        RF_GAIN_MGC,
        RF_GAIN_FASTATTACK_AGC,
        RF_GAIN_SLOWATTACK_AGC,
        RF_GAIN_HYBRID_AGC
    };
    enum FastAGCTargetGainIndexType
    {
        MAX_GAIN,
        SET_GAIN,
        OPTIMIZED_GAIN,
        NO_GAIN_CHANGE,
    };
    struct GainControl
    {
        AD9361::RFGainCtrlMode rx1_mode;
        AD9361::RFGainCtrlMode rx2_mode;

        /* Common */
        uint8_t adc_ovr_sample_size; /* 1..8 Sum x samples, AGC_CONFIG_3 */
        uint8_t adc_small_overload_thresh; /* 0..255, 0x105 */
        uint8_t adc_large_overload_thresh; /* 0..255, 0x104 */
        uint16_t lmt_overload_high_thresh; /* 16..800 mV, 0x107 */
        uint16_t lmt_overload_low_thresh; /* 16..800 mV, 0x108 */
        uint16_t dec_pow_measuremnt_duration; /* Samples, 0x15C */
        uint8_t low_power_thresh; /* -64..0 dBFS, 0x114 */
        bool use_rx_fir_out_for_dec_pwr_meas; /* clears 0x15C:6 USE_HB1_OUT_FOR_DEC_PWR_MEAS */
        bool dig_gain_en; /* should be turned off, since ADI GT doesn't use dig gain */
        uint8_t max_dig_gain; /* 0..31 */

        /* MGC */
        bool mgc_rx1_ctrl_inp_en; /* Enables Pin control on RX1 default SPI ctrl */
        bool mgc_rx2_ctrl_inp_en; /* Enables Pin control on RX2 default SPI ctrl */
        uint8_t mgc_inc_gain_step; /* 1..8 */
        uint8_t mgc_dec_gain_step; /* 1..8 */
        uint8_t mgc_split_table_ctrl_inp_gain_mode; /* 0=AGC determine this, 1=only in LPF, 2=only in LMT */

        /* AGC */
        uint8_t agc_attack_delay_extra_margin_us; /* 0..31 us */
        uint8_t agc_outer_thresh_high;
        uint8_t agc_outer_thresh_high_dec_steps;
        uint8_t agc_inner_thresh_high;
        uint8_t agc_inner_thresh_high_dec_steps;
        uint8_t agc_inner_thresh_low;
        uint8_t agc_inner_thresh_low_inc_steps;
        uint8_t agc_outer_thresh_low;
        uint8_t agc_outer_thresh_low_inc_steps;
        uint8_t adc_small_overload_exceed_counter; /* 0..15, 0x122 */
        uint8_t adc_large_overload_exceed_counter; /* 0..15, 0x122 */
        uint8_t adc_large_overload_inc_steps; /* 0..15, 0x106 */
        bool adc_lmt_small_overload_prevent_gain_inc; /* 0x120 */
        uint8_t lmt_overload_large_exceed_counter; /* 0..15, 0x121 */
        uint8_t lmt_overload_small_exceed_counter; /* 0..15, 0x121 */
        uint8_t lmt_overload_large_inc_steps; /* 0..7, 0x121 */
        uint8_t dig_saturation_exceed_counter; /* 0..15, 0x128 */
        uint8_t dig_gain_step_size; /* 1..8, 0x100 */
        bool sync_for_gain_counter_en; /* 0x128:4 !Hybrid */
        uint32_t gain_update_interval_us; /* in us */
        bool immed_gain_change_if_large_adc_overload; /* 0x123:3 */
        bool immed_gain_change_if_large_lmt_overload; /* 0x123:7 */

        /* Fast AGC */
        uint32_t f_agc_dec_pow_measuremnt_duration;  /* Samples, 0x15C */
        uint32_t f_agc_state_wait_time_ns; /* 0x117 0..31 RX samples -> time_ns */
        /* Fast AGC - Low Power */
        bool f_agc_allow_agc_gain_increase; /* 0x110:1 */
        uint8_t f_agc_lp_thresh_increment_time; /* 0x11B RX samples */
        uint8_t f_agc_lp_thresh_increment_steps; /* 0x117 1..8 */
        /* Fast AGC - Lock Level */
        uint8_t f_agc_lock_level; /* NOT USED: 0x101 0..-127 dBFS same as agc_inner_thresh_high */
        bool f_agc_lock_level_lmt_gain_increase_en; /* 0x111:6 */
        uint8_t f_agc_lock_level_gain_increase_upper_limit; /* 0x118 0..63 */
        /* Fast AGC - Peak Detectors and Final Settling */
        uint8_t f_agc_lpf_final_settling_steps; /* 0x112:6 0..3 (Post Lock Level Step)*/
        uint8_t f_agc_lmt_final_settling_steps; /* 0x113:6 0..3 (Post Lock Level Step)*/
        uint8_t f_agc_final_overrange_count; /* 0x116:5 0..7 */
        /* Fast AGC - Final Power Test */
        bool f_agc_gain_increase_after_gain_lock_en; /* 0x110:7  */
        /* Fast AGC - Unlocking the Gain */
        AD9361::FastAGCTargetGainIndexType f_agc_gain_index_type_after_exit_rx_mode; /* 0x110:[4,2]  */
        bool f_agc_use_last_lock_level_for_set_gain_en; /* 0x111:7 */
        uint8_t f_agc_optimized_gain_offset;    /*0x116 0..15 steps */
        bool f_agc_rst_gla_stronger_sig_thresh_exceeded_en; /* 0x110:~6 */
        uint8_t f_agc_rst_gla_stronger_sig_thresh_above_ll;    /*0x113 0..63 dbFS */
        bool f_agc_rst_gla_engergy_lost_sig_thresh_exceeded_en; /* 0x110:6 */
        bool f_agc_rst_gla_engergy_lost_goto_optim_gain_en; /* 0x110:6 */
        uint8_t f_agc_rst_gla_engergy_lost_sig_thresh_below_ll; /* 0x112:6 */
        uint8_t f_agc_energy_lost_stronger_sig_gain_lock_exit_cnt; /* 0x119 0..63 RX samples */
        bool f_agc_rst_gla_large_adc_overload_en; /*0x110:~1 and 0x114:~7 */
        bool f_agc_rst_gla_large_lmt_overload_en; /*0x110:~1 */
        bool f_agc_rst_gla_en_agc_pulled_high_en;
        AD9361::FastAGCTargetGainIndexType f_agc_rst_gla_if_en_agc_pulled_high_mode; /* 0x0FB, 0x111 */
        uint8_t f_agc_power_measurement_duration_in_state5; /* 0x109, 0x10a RX samples 0..524288*/
        uint8_t f_agc_large_overload_inc_steps; /* 0x106 [D6:D4] 0..7 */
    };
    struct AUXDACControl
    {
        double dac1_default_value;
        double dac2_default_value;

        bool auxdac_manual_mode_en;

        bool dac1_in_rx_en;
        bool dac1_in_tx_en;
        bool dac1_in_alert_en;

        bool dac2_in_rx_en;
        bool dac2_in_tx_en;
        bool dac2_in_alert_en;

        uint8_t dac1_rx_delay_us;
        uint8_t dac1_tx_delay_us;
        uint8_t dac2_rx_delay_us;
        uint8_t dac2_tx_delay_us;
    };
    enum RSSIRestartMode
    {
        AGC_IN_FAST_ATTACK_MODE_LOCKS_THE_GAIN,
        EN_AGC_PIN_IS_PULLED_HIGH,
        ENTERS_RX_MODE,
        GAIN_CHANGE_OCCURS,
        SPI_WRITE_TO_REGISTER,
        GAIN_CHANGE_OCCURS_OR_EN_AGC_PIN_PULLED_HIGH,
    };
    struct RSSIControl
    {
        AD9361::RSSIRestartMode restart_mode;
        bool rssi_unit_is_rx_samples;    /* default unit is time */
        uint32_t rssi_delay;
        uint32_t rssi_wait;
